# 데이터프레임의 데이터 조작

In [1]:
import numpy as np
import pandas as pd

### 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [4]:
s.count()

9

In [5]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [6]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [302]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

### 카테고리 값 세기

In [10]:
np.random.seed(2020)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    5
96    5
97    5
98    2
99    2
dtype: int32

In [11]:
s2.value_counts()

0    20
3    18
2    17
1    17
5    16
4    12
dtype: int64

In [12]:
df[0].value_counts() # 0열의 각 숫자 갯수

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

### 정렬

In [14]:
s2.value_counts().sort_index() # 인덱스 순서를 기준으로 결과를 출력. sort를 안할 경우 자료가 많은 것부터 순서대로 출력(s2.value_counts()의 결과와 같지만 순서가 다르다)

0    20
1    17
2    17
3    18
4    12
5    16
dtype: int64

In [15]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [16]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [17]:
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [18]:
df.sort_values(by=[1, 2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [28]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [29]:
df2.sum(axis=1) # 행방향의 합

0    35
1    34
2    41
3    42
dtype: int64

In [30]:
df2.sum(axis=0) # 열방향의 합

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [31]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [32]:
df2.loc['ColTotal', :] = df2.sum()
df2

             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

In [34]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [46]:
# 1. 타이타닉호 승객의 평균 나이를 구하라
titanic["age"].sum()/titanic['age'].count()

29.69911764705882

In [102]:
round(titanic.age.mean(), 2)

29.7

In [81]:
# 2. 타이타닉호 승객 중 여성 승객의 평균 나이를 구하라
titanic[(titanic['sex'] == 'female')]['age'].sum()/titanic[(titanic['sex'] == 'female')]['age'].count()

27.915708812260537

In [100]:
# 2. 타이타닉호 승객 중 여성 승객의 평균 나이를 구하라
round(titanic[titanic.sex == 'female'].age.mean(), 2)

27.92

In [289]:
# 3. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라
titanic[(titanic['pclass'] == 1)][(titanic['sex'] == 'female')]['age'].sum()/titanic[(titanic['pclass'] == 1)][(titanic['sex'] == 'female')]['age'].count()

34.14140488110137

In [104]:
round(titanic[titanic.pclass == 1][titanic.sex == 'female'].age.mean(), 2)

34.61

In [105]:
titanic['age'].groupby(titanic['sex']).mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

### apply 변환

In [120]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [121]:
df3.apply(lambda x: x.max() - x.min()) 
# 열 중에서 최대값에서 최소값을 뺀 값을 결과로 출력

A    3
B    2
C    4
dtype: int64

In [122]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [123]:
df3.apply(pd.value_counts) # 각 숫자의 갯수를 표현

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [124]:
## 연습문제 4.4.4

titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail() # 조건부로 인덱스 추가

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

### fillna 메서드

In [128]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [133]:
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [134]:
titanic['age'] = titanic['age'].fillna(titanic['age'].mean())
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

### astype 메서드

In [136]:
df3.apply(pd.value_counts).fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [137]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [152]:
# 연습문제 4.4.6
titanic['category2'] = titanic['sex'] + titanic['age'].astype(int).astype(str)
titanic.tail() # 인수로 변환 후 다시 문자열로 변환

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category2
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male27
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,female19
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female29
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male26
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male32

### 실수 값을 카테고리 값으로 변환

In [153]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [154]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 장년, 미성년자, 중년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [155]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [156]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [157]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [158]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN

In [159]:
df4.age_cat.astype(str) + df4.ages.astype(str)

0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11    nan101
dtype: object

In [160]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

[Q2, Q1, Q2, Q3, Q1, ..., Q1, Q1, Q4, Q4, Q2]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [161]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64

In [163]:
cats.value_counts()

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

In [259]:
# 연습문제 4.4.7 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다. 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanics = pd.cut(titanic['age'], bins, labels=labels)

print(titanics)

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age, Length: 891, dtype: category
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [258]:
print(titanics.value_counts()/titanics.count())

청년      0.464082
중년      0.274800
미성년자    0.188141
장년      0.067275
노년      0.005701
Name: age, dtype: float64

In [187]:
titanic2 = pd.DataFrame(titanic['age'].astype(int), columns=["age"])
titanic2["age_cut"] = pd.cut(titanic2.age, bins, labels=labels)
titanic2

     age age_cut
0     22      청년
1     38      중년
2     26      청년
3     35      중년
4     35      중년
..   ...     ...
886   27      청년
887   19    미성년자
888   29      청년
889   26      청년
890   32      중년

[891 rows x 2 columns]

In [269]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

# 1. 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.

# 2. 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

SyntaxError: invalid syntax (<ipython-input-269-a10138266797>, line 7)

In [303]:
titanic["sex"] = titanic.apply(lambda r: "여성" if r.sex == "female" else "남성", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,남성,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,여성,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,여성,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,남성,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,남성,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [304]:
titanic['category3'] = titanic2.age_cut.astype(str) + titanic.sex
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category3
886,0,2,남성,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,청년남성
887,1,1,여성,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,미성년자여성
888,0,3,여성,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,청년여성
889,1,1,남성,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,청년남성
890,0,3,남성,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,중년남성

In [306]:
titanic["category3"] = titanic.apply(lambda r: "미성년자" if r.category3 == "미성년자여성" else r.category3, axis=1)
titanic.tail() # 2번 실행함

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category3
886,0,2,남성,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,청년남성
887,1,1,여성,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,미성년자
888,0,3,여성,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,청년여성
889,1,1,남성,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,청년남성
890,0,3,남성,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,중년남성

In [307]:
titanic["category3"] = titanic.apply(lambda r: "미성년자" if r.category3 == "미성년자남성" else r.category3, axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category3
886,0,2,남성,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,청년남성
887,1,1,여성,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,미성년자
888,0,3,여성,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,청년여성
889,1,1,남성,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,청년남성
890,0,3,남성,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,중년남성